In [22]:
import numpy as np
import pandas as pd

#The Machine learning alogorithm
from sklearn.ensemble import RandomForestClassifier

# Test train split
from sklearn.model_selection import train_test_split

# Just to switch off pandas warning
pd.options.mode.chained_assignment = None

# Used to write our model to a file
import joblib

In [23]:
data = pd.read_csv("titanic_train.csv")
data.head()

,Unnamed: 0,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,998,999,3rd,1,"McCarthy, Miss Katie",NaN,NaN,NaN,NaN,NaN,NaN,female
1,179,180,1st,0,"Millet, Mr Francis Davis",65.0,Southampton,"East Bridgewater, MA",NaN,NaN,(249),male
2,556,557,2nd,0,"Sjostedt, Mr Ernst Adolf",59.0,Southampton,"Sault St Marie, ON",NaN,NaN,NaN,male
3,174,175,1st,0,"McCaffry, Mr Thomas Francis",46.0,Cherbourg,"Vancouver, BC",NaN,NaN,(292),male
4,1232,1233,3rd,0,"Strilic, Mr Ivan",NaN,NaN,NaN,NaN,NaN,NaN,male

In [24]:
data.columns

Index(['Unnamed: 0', 'row.names', 'pclass', 'survived', 'name', 'age',
       'embarked', 'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [25]:
median_age = data['age'].median()
print("Median age is {}".format(median_age))

Median age is 29.0

In [26]:
data['age'].fillna(median_age, inplace = True)
data['age'].head()

0    29.0
1    65.0
2    59.0
3    46.0
4    29.0
Name: age, dtype: float64

In [27]:
data_inputs = data[["pclass", "age", "sex"]]
data_inputs.head()

  pclass   age     sex
0    3rd  29.0  female
1    1st  65.0    male
2    2nd  59.0    male
3    1st  46.0    male
4    3rd  29.0    male

In [28]:
expected_output = data[["survived"]]
expected_output.head()

   survived
0         1
1         0
2         0
3         0
4         0

In [29]:
data_inputs["pclass"].replace("3rd", 3, inplace = True)
data_inputs["pclass"].replace("2nd", 2, inplace = True)
data_inputs["pclass"].replace("1st", 1, inplace = True)
data_inputs.head()

   pclass   age     sex
0       3  29.0  female
1       1  65.0    male
2       2  59.0    male
3       1  46.0    male
4       3  29.0    male

In [30]:
data_inputs["sex"] = np.where(data_inputs["sex"] == "female", 0, 1)
data_inputs.head()

   pclass   age  sex
0       3  29.0    0
1       1  65.0    1
2       2  59.0    1
3       1  46.0    1
4       3  29.0    1

In [31]:
inputs_train, inputs_test, expected_output_train, expected_output_test   = train_test_split (data_inputs, expected_output, test_size = 0.33, random_state = 42)

print(inputs_train.head())
print(expected_output_train.head())

     pclass   age  sex
618       3  19.0    1
169       3  29.0    1
830       1  54.0    1
140       3  29.0    1
173       2  28.0    1
     survived
618         0
169         0
830         1
140         0
173         0

In [32]:
rf = RandomForestClassifier (n_estimators=100)

In [33]:
rf.fit(inputs_train, expected_output_train)

<ipython-input-33-7d813089c01c>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(inputs_train, expected_output_train)

RandomForestClassifier()

In [34]:
accuracy = rf.score(inputs_test, expected_output_test)
print("Accuracy = {}%".format(accuracy * 100))

Accuracy = 78.28947368421053%

In [35]:
joblib.dump(rf, "titanic_model1", compress=9)

['titanic_model1']